import React from 'react'

function PlanetSvg3() {
  return (
    <svg
      id="Flat"
      xmlns="http://www.w3.org/2000/svg"
      width="65.595"
      height="65.595"
      viewBox="0 0 65.595 65.595"
    >
      <path
        id="路径_80"
        data-name="路径 80"
        d="M68.975,787.362c-1.821-1.821-1.6-5.394.249-9.911l.44-1.254-2.586-6.765c-5.921,10.145-7.576,19.1-3.426,23.254l5.323-5.323Z"
        transform="translate(-60.257 -730.484)"
        fill="#c378cb"
      />
      <path
        id="路径_81"
        data-name="路径 81"
        d="M792.685,63.65c-4.151-4.15-13.109-2.493-23.254,3.426l6.354,2.883,1.665-.736c4.517-1.851,8.09-2.071,9.911-.249Z"
        transform="translate(-730.484 -60.257)"
        fill="#c378cb"
      />
      <path
        id="路径_82"
        data-name="路径 82"
        d="M197.812,170.481q0,.9-.059,1.792a27.282,27.282,0,0,1-25.481,25.481q-.888.059-1.792.059A27.208,27.208,0,0,1,154.98,193q-.91-.629-1.766-1.327a27.532,27.532,0,0,1-4.4-4.521q-.674-.877-1.279-1.808a27.182,27.182,0,0,1-4.384-14.409c0-.15,0-.3,0-.45A27.307,27.307,0,0,1,167.7,143.289q1.372-.137,2.78-.139c.15,0,.3,0,.45,0a27.25,27.25,0,0,1,6.855.984q1.189.328,2.334.76a27.382,27.382,0,0,1,11.549,8.317q.7.855,1.327,1.766a27.208,27.208,0,0,1,4.817,15.5Z"
        transform="translate(-137.684 -137.684)"
        fill="#5f4bbc"
      />
      <path
        id="路径_83"
        data-name="路径 83"
        d="M157.873,109.708c1.821,1.821,1.6,5.395-.249,9.911-2.561,6.252-8.247,14.312-15.967,22.032s-15.78,13.406-22.032,15.968c-4.517,1.851-8.09,2.071-9.911.249l-5.323,5.323c4.151,4.15,13.109,2.495,23.254-3.426a90.661,90.661,0,0,0,17.985-14.142,90.67,90.67,0,0,0,14.142-17.985c5.921-10.145,7.576-19.1,3.426-23.254Z"
        transform="translate(-100.995 -100.991)"
        fill="#c378cb"
      />
      <g id="组_176" data-name="组 176" transform="translate(5.466 5.466)">
        <path
          id="路径_84"
          data-name="路径 84"
          d="M476.133,162.391l-18.7,18.7-1.547-1.547L473.8,161.632q1.189.328,2.334.76Z"
          transform="translate(-439.163 -160.644)"
          fill="#4f3dab"
        />
        <path
          id="路径_85"
          data-name="路径 85"
          d="M0,0H14.589V2.186H0Z"
          transform="translate(4.21 31.407) rotate(-45)"
          fill="#4f3dab"
        />
        <path
          id="路径_86"
          data-name="路径 86"
          d="M889.064,333.183l-8.987,8.985-1.546-1.546,9.205-9.205Q888.436,332.272,889.064,333.183Z"
          transform="translate(-839.219 -321.353)"
          fill="#4f3dab"
        />
        <path
          id="路径_87"
          data-name="路径 87"
          d="M0,0H3.092V2.186H0Z"
          transform="translate(35.296 23.28) rotate(-45)"
          fill="#4f3dab"
        />
        <path
          id="路径_88"
          data-name="路径 88"
          d="M0,0H17.842V2.186H0Z"
          transform="translate(21.085 37.489) rotate(-45)"
          fill="#4f3dab"
        />
        <path
          id="路径_89"
          data-name="路径 89"
          d="M342.305,877.521l-9.122,9.123q-.91-.629-1.766-1.327l9.342-9.342Z"
          transform="translate(-321.353 -836.799)"
          fill="#4f3dab"
        />
        <path
          id="路径_90"
          data-name="路径 90"
          d="M486.3,143.154l-8.422,8.422-1.547-1.547,6.74-6.74q1.372-.137,2.78-.139C486,143.15,486.15,143.151,486.3,143.154Z"
          transform="translate(-458.52 -143.15)"
          fill="#4f3dab"
        />
        <path
          id="路径_91"
          data-name="路径 91"
          d="M160.322,314.279l-17.168,17.168c0-.15,0-.3,0-.45a27.471,27.471,0,0,1,.139-2.78l15.486-15.486Z"
          transform="translate(-143.15 -303.666)"
          fill="#4f3dab"
        />
        <path
          id="路径_92"
          data-name="路径 92"
          d="M262.765,279.048,226.51,314.3q-.674-.877-1.279-1.808l36.01-35.009Z"
          transform="translate(-220.843 -270.3)"
          fill="#4f3dab"
        />
        <path
          id="路径_93"
          data-name="路径 93"
          d="M880.9,687.912a27.209,27.209,0,0,1-.465,3.558L866.429,705.48l-1.547-1.547Z"
          transform="translate(-826.298 -658.79)"
          fill="#4f3dab"
        />
        <path
          id="路径_94"
          data-name="路径 94"
          d="M696.734,1030.029l-5.263,5.263a27.209,27.209,0,0,1-3.558.465l7.274-7.274Z"
          transform="translate(-658.79 -981.152)"
          fill="#4f3dab"
        />
      </g>
      <path
        id="路径_95"
        data-name="路径 95"
        d="M306.75,40.9h2.186v2.187H306.75Z"
        transform="translate(-292.538 -40.9)"
        fill="#ffba40"
      />
      <path
        id="路径_96"
        data-name="路径 96"
        d="M40.9,306.75h2.187v2.186H40.9Z"
        transform="translate(-40.9 -292.538)"
        fill="#ffba40"
      />
      <path
        id="路径_97"
        data-name="路径 97"
        d="M1206.55,1063.4h2.187v2.187h-2.187Z"
        transform="translate(-1144.235 -1008.738)"
        fill="#ffba40"
      />
      <path
        id="路径_98"
        data-name="路径 98"
        d="M1026.873,1104.3h-2.187v3.28H1022.5v2.187h2.187v3.28h2.187v-3.28h2.186v-2.187h-2.186Z"
        transform="translate(-970.024 -1047.451)"
        fill="#ffba40"
      />
      <path
        id="路径_99"
        data-name="路径 99"
        d="M106.623,102.25h-2.187v3.28H102.25v2.186h2.187V111h2.187v-3.28h2.187V105.53h-2.187Z"
        transform="translate(-98.97 -98.97)"
        fill="#ffba40"
      />
      <path
        id="路径_100"
        data-name="路径 100"
        d="M858.9,1186.1h2.186v2.187H858.9Z"
        transform="translate(-815.17 -1124.878)"
        fill="#ffba40"
      />
      <path
        id="路径_101"
        data-name="路径 101"
        d="M40.9,756.65h2.187v2.187H40.9Z"
        transform="translate(-40.9 -718.386)"
        fill="#ffba40"
      />
      <path
        id="路径_102"
        data-name="路径 102"
        d="M1227,490.8h2.187v2.186H1227Z"
        transform="translate(-1163.592 -466.749)"
        fill="#ffba40"
      />
      <path
        id="路径_103"
        data-name="路径 103"
        d="M552.15,61.35h2.187v2.186H552.15Z"
        transform="translate(-524.819 -60.257)"
        fill="#f98500"
      />
      <path
        id="路径_104"
        data-name="路径 104"
        d="M81.8,409h2.187v2.187H81.8Z"
        transform="translate(-79.614 -389.322)"
        fill="#f98500"
      />
      <path
        id="路径_105"
        data-name="路径 105"
        d="M1165.65,899.8h2.187v2.187h-2.187Z"
        transform="translate(-1105.521 -853.884)"
        fill="#f98500"
      />
      <path
        id="路径_106"
        data-name="路径 106"
        d="M511.25,1227h2.187v2.187H511.25Z"
        transform="translate(-486.105 -1163.592)"
        fill="#f98500"
      />
    </svg>
  )
}

export default PlanetSvg3
